garyPenhook/PIC-Assembler/Microchip.PIC12-16F1xxx_DFP.1.8.254.atpack_FILES/edc/PIC16F1709.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CLC3GLS3" edc:desc="Gate logic select register 3" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CLC3GLS3" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02286_CLC.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0xF2D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LC3G4D1N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D1T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D2N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D2T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D3N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D3T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D4N" edc:desc="" edc:mask="0x1" edc:name="LC3G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LC3G4D4T" edc:desc="" edc:mask="0x1" edc:name="LC3G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="G4D1N" edc:desc="" edc:mask="0x1" edc:name="G4D1N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D1T" edc:desc="" edc:mask="0x1" edc:name="G4D1T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2N" edc:desc="" edc:mask="0x1" edc:name="G4D2N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D2T" edc:desc="" edc:mask="0x1" edc:name="G4D2T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3N" edc:desc="" edc:mask="0x1" edc:name="G4D3N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D3T" edc:desc="" edc:mask="0x1" edc:name="G4D3T" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4N" edc:desc="" edc:mask="0x1" edc:name="G4D4N" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="G4D4T" edc:desc="" edc:mask="0x1" edc:name="G4D4T" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0" edc:_addr="0xF80"/>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="ICDIO" edc:desc="" edc:impl="0xfc" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxx--" edc:name="ICDIO" edc:nzwidth="8" edc:por="xxxxxx--" edc:_addr="0xF8C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TRIS_ICDCLK" edc:desc="" edc:mask="0x1" edc:name="TRIS_ICDCLK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIS_ICDDAT" edc:desc="" edc:mask="0x1" edc:name="TRIS_ICDDAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LAT_ICDCLK" edc:desc="" edc:mask="0x1" edc:name="LAT_ICDCLK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LAT_ICDDAT" edc:desc="" edc:mask="0x1" edc:name="LAT_ICDDAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PORT_ICDCLK" edc:desc="" edc:mask="0x1" edc:name="PORT_ICDCLK" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PORT_ICDDAT" edc:desc="" edc:mask="0x1" edc:name="PORT_ICDDAT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n--n" edc:cname="ICDCON0" edc:desc="" edc:impl="0xe9" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxx-x--x" edc:name="ICDCON0" edc:nzwidth="8" edc:por="xxx-x--x" edc:_addr="0xF8D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RSTVEC" edc:desc="" edc:mask="0x1" edc:name="RSTVEC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DBGINEX" edc:desc="" edc:mask="0x1" edc:name="DBGINEX" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SSTEP" edc:desc="" edc:mask="0x1" edc:name="SSTEP" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FREEZ" edc:desc="" edc:mask="0x1" edc:name="FREEZ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INBUG" edc:desc="" edc:mask="0x1" edc:name="INBUG" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="3" edc:_addr="0xF8E"/>
        <edc:SFRDef edc:access="nn----n-" edc:cname="ICDSTAT" edc:desc="" edc:impl="0xc2" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx----x-" edc:name="ICDSTAT" edc:nzwidth="8" edc:por="xx----x-" edc:_addr="0xF91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="USRHLTF" edc:desc="" edc:mask="0x1" edc:name="USRHLTF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="TRP0HLTF" edc:desc="" edc:mask="0x1" edc:name="TRP0HLTF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRP1HLTF" edc:desc="" edc:mask="0x1" edc:name="TRP1HLTF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------" edc:cname="CLKRFRZ" edc:desc="" edc:impl="0x0" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------" edc:name="CLKRFRZ" edc:nzwidth="8" edc:por="--------" edc:_addr="0xF92">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0"/>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0xF93"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="DEVSEL" edc:desc="" edc:impl="0x7" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----xxx" edc:name="DEVSEL" edc:nzwidth="8" edc:por="-----xxx" edc:_addr="0xF95">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DEVSEL0" edc:desc="" edc:mask="0x1" edc:name="DEVSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DEVSEL1" edc:desc="" edc:mask="0x1" edc:name="DEVSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DEVSEL2" edc:desc="" edc:mask="0x1" edc:name="DEVSEL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="ICDINSTL" edc:desc="" edc:impl="0xff" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="ICDINSTL" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_addr="0xF96">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBGIN0" edc:desc="" edc:mask="0x1" edc:name="DBGIN0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN1" edc:desc="" edc:mask="0x1" edc:name="DBGIN1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN2" edc:desc="" edc:mask="0x1" edc:name="DBGIN2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN3" edc:desc="" edc:mask="0x1" edc:name="DBGIN3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN4" edc:desc="" edc:mask="0x1" edc:name="DBGIN4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN5" edc:desc="" edc:mask="0x1" edc:name="DBGIN5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN6" edc:desc="" edc:mask="0x1" edc:name="DBGIN6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN7" edc:desc="" edc:mask="0x1" edc:name="DBGIN7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ICDINSTH" edc:desc="" edc:impl="0x3f" edc:ishidden="true" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxx" edc:name="ICDINSTH" edc:nzwidth="8" edc:por="--xxxxxx" edc:_addr="0xF97">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DBGIN8" edc:desc="" edc:mask="0x1" edc:name="DBGIN8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN9" edc:desc="" edc:mask="0x1" edc:name="DBGIN9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN10" edc:desc="" edc:mask="0x1" edc:name="DBGIN10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN11" edc:desc="" edc:mask="0x1" edc:name="DBGIN11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN12" edc:desc="" edc:mask="0x1" edc:name="DBGIN12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DBGIN13" edc:desc="" edc:mask="0x1" edc:name="DBGIN13" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
